//                   _ooOoo_
//                  o8888888o
//                  88" . "88
//                  (| -_- |)
//                  O\  =  /O
//               ____/`---'\____
//             .'  \\|     |//  `.
//            /  \\|||  :  |||//  \
//           /  _||||| -:- |||||-  \
//           |   | \\\  -  /// |   |
//           | \_|  ''\---/''  |   |
//           \  .-\__  `-`  ___/-. /
//         ___`. .'  /--.--\  `. . __
//      ."" '<  `.___\_<|>_/___.'  >'"".
//     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//     \  \ `-.   \_ __\ /__ _/   .-` /  /
//======`-.____`-.___\_____/___.-`____.-'======
//                   `=---='
//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//         佛祖保佑       永无BUG
//  本模块已经经过开光处理，绝无可能再产生bug
//=============================================
#include <iostream>
using namespace std;
typedef long long ll;
ll  n,a1,r1,a2,r2;
void Ex_gcd(ll a,ll b,ll &d,ll &x,ll &y)
{
	if(!b){
		x=1,y=0,d=a;
	}
	else{
		Ex_gcd(b,a%b,d,y,x);
		y-=x*(a/b);
	}
} 

ll solve()
{
	ll a,b,c,d,x0,y0,ifhave;
	scanf("%I64d%I64d",&a1,&r1);
	for(int i=1;i<n;i++){
		scanf("%I64d%I64d",&a2,&r2);
		a=a1,b=a2,c=r2-r1;
		Ex_gcd(a,b,d,x0,y0);
		if(c%d!=0){
			ifhave=0;
		}
		int t=b/d;
		x0=(x0*(c/d)%t+t)%t;
		r1=a1*x0+r1;
		a1=a1*(a2/d);
	}
	if(!ifhave){
		r1=-1;
	}
	return r1;
}
int main()
{
	while(cin>>n){
		cout<<solve()<<endl;
	}
	
} 
